tutorials/DXOverIsoFlow/damBreak/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0    0.0  -0.15)
    (2.0    0.0  -0.15)
    (2.0    0.02  -0.15)
    (0.0    0.02  -0.15)
    (0.0    0.0  0.45)
    (2.0    0.0  0.45)
    (2.0    0.02  0.45)
    (0.0    0.02  0.45)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other
    // bcs
    oversetPatch
    {
        type overset;
        faces ();
    }

    stationaryWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (2 6 5 1)
            (0 4 7 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces 
	(
            (1 5 4 0)
            (3 7 6 2)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
