tutorials/DXOverIsoFlow/damBreak/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    ("libsixDoFRigidBodyMotion_ABM.so");

dynamicFvMesh       dynamicOversetFvMesh;

solver          	sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (floatingObject);
    innerDistance   100;  
    outerDistance   101;  

    centreOfMass    (0.3 0.0 0.02);

    // Cuboid mass
    mass            0.18;

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia  (1 0.0015 1);

    report          on;
    accelerationRelaxation 0.1;

    solver
    {
        type 		ABM;
    }

    constraints
    {
        fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }
        fixedPlane
        {
            sixDoFRigidBodyMotionConstraint plane;
            normal (0 1 0);
        }
        fixedLine
        {
            sixDoFRigidBodyMotionConstraint line;
            direction (0 0 1);
        }
    }
}


// ************************************************************************* //
